PSYC798W_Winter2019_syllabus.org
#+TITLE:     PSYC798W: R Programming for Behavioral Sciences (Winter 2019)
#+AUTHOR:    
#+EMAIL:     scottrj@umd.edu
#+DATE:      
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:nil toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t ':t
#+OPTIONS:   TeX:t LaTeX:nil skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+LATEX_CLASS: tufte-handout

#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
* Basic info
  - Instructor: :: Dr. Scott Jackson
  - Email: :: [[mailto:scottrj@umd.edu][scottrj@umd.edu]]
  - Office phone: :: 301-226-8881
  - Class location: :: BPS 1236
  - Time: :: M-F, 9:30-12:30
  - Office hours: :: 12:30-1:30, or by appointment
  - Office hours location: :: TBD
  - Course material repository: :: [[https://github.com/scottrjackson/r_programming_bsos_winter2019]]

* Description
R @@latex:\marginnote{\texttt{www.r-project.org}}@@ is a programming language and environment designed for statistical analysis. It is free and open-source, and it includes integration with thousands of cutting-edge packages contributed by users from around the world. It has become a /de facto/ standard and /lingua franca/ for statistical analysis.  It is an incredibly powerful tool for data analysis and visualization, and thus an indispensable tool for any kind of quantitative work in the behavioral and social sciences. However, because many (if not most) students and researchers in these fields are not otherwise trained in programming techniques, learning R can be difficult, and poor understanding of programming concepts and techniques can create problems in analysis and reporting of results. 

This course aims to give you a foundation in programming, in order to facilitate future work with R.  It is not a stats course, though we will address a few topics critical to data analysis such as cleaning, formatting, and visualizing your data.  The focus of the course is building concepts, skills, and habits to make you a better programmer, in order to get the most out of R.
* Goals
This course is organized around two sets of themes. First, there is the underlying argument for why a programming language like R is a superior alternative to more limited graphical-interface programs like SPSS or spreadsheet programs like Excel.  You can think of the advantages of R as superpowers for doing research.  There are (at least) three of them:

  - Reproducibility :: You can go back to see *exactly* what you did, and you can do it again, with virtually no effort.  This also helps make your code work better, and easier to improve upon.
  - Repetition :: You can take something you did, and do it hundreds, thousands, or /millions/ of times (literally), with very little effort (though maybe some patience). This opens up new avenues like simulations or other kinds of industrial-strength analysis.
  - Re-usable code :: You can take code you write and apply it to new situations. This makes what you do more useful, and more share-able.  Share-ability leads to fame and fortune.

In this course, you will learn the basics of each of these superpowers.  You will be able to:
  - work in a more reproducible way using scripts, notebooks, and version control.
  - repeat analysis in loops and other structures to be able to perform large-scale repetition and simulation.
  - write functions to make your code more re-usable and generally applicable, for yourself and others.

In order to acquire these superpowers, there are three types of topics we will cover:
  - Core R language: :: You will learn the basics of the R language and be able to work with a variety of data types, functions, and computations.
  - Tools: :: You will learn to use one or more interfaces to R (i.e., ways to run R), you will have an opportunity to learn and practice workflows for data analysis, and you will learn the basics of version control software (=git=).
  - Techniques: :: There are lots of ways to do things in R, and you will learn useful tips and best practices for structuring code, documenting code, adapting code, and finding help when you need it.

In summary, this course will help you approach your work with R more like a programmer, which will enable you to make the most of the superpowers that R provides access to.
* Structure of class time
Each class is 3 hours.  This time will be divided roughly into four parts:
  1. *Review:* We will go over the previous day's homework and answer any outstanding questions.
  2. *Lecture:* I'll present some concepts, with slides and/or demos.
  3. *Practice:* You will have some in-class exercises to try, in order to immediately apply the concepts from the lecture.
  4. *Follow-up and troubleshooting:* Things will inevitably go wrong. You are very unlikely to perfectly apply the concepts the first time during practice, and I will probably forget to mention some things along the way. So we will reserve the last hour to talk about the problems you encounter in practice and solutions to those problems.  If everything goes unexpectedly smoothly, we will use this time to cover more advanced extensions of the concepts.
* Schedule
The following schedule is a work in progress.  Check the online version of this syllabus for the most up-to-date schedule, in case you need to miss a class but are interested in specific topics. In particular, the "special topic" and "review" days may be used as "spillover" days if we need to move more slowly or repeat any of the other topics, and if we have time for special topics, those may change based on student interest.

| Date   | Topic                                                        |
|--------+--------------------------------------------------------------|
| Jan 7  | Getting started; installation; workflow overview             |
| Jan 8  | Basics #1: objects, functions, packages, and the environment |
| Jan 9  | Basics #2: working with different kinds of data              |
| Jan 10 | Basics #3: working with complex objects and messy data       |
| Jan 11 | Basics #4: graphics                                          |
| Jan 14 | Review: more graphics or other review                        |
| Jan 15 | Iteration #1: loops and control                              |
| Jan 16 | Iteration #2: vectorization                                  |
| Jan 17 | Writing functions                                            |
| Jan 18 | Review, simulations (cont'd)             |

* Grading
** Overall
There are three main components that determine your grade:
   1. In-class Practices
   2. Out-of-class Homework
   3. The Final Project

The overall course grading is based on how much of these components you complete on time:
 - A :: = Completed all three components
 - B :: = Completed two components
 - C :: = Completed one component
 - D :: = Did some work but did not complete any components
 - F :: = Left out one or more components entirely

What it means to "complete" each of these is described below.
