PSYC798W_Winter2019_syllabus.tex
% Created 2019-01-07 Mon 08:12
% Intended LaTeX compiler: pdflatex
\documentclass{tufte-handout}
\date{}
\title{PSYC798W: R Programming for Behavioral Sciences (Winter 2019)}
\hypersetup{
 pdfauthor={},
 pdftitle={PSYC798W: R Programming for Behavioral Sciences (Winter 2019)},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.1 (Org mode 9.1.14)}, 
 pdflang={English}}
\begin{document}

\maketitle
\section*{Basic info}
\label{sec:org3c04f5f}
\begin{description}
\item[{Instructor:}] Dr. Scott Jackson
\item[{Email:}] \href{mailto:scottrj@umd.edu}{scottrj@umd.edu}
\item[{Office phone:}] 301-226-8881
\item[{Class location:}] BPS 1236
\item[{Time:}] M-F, 9:30-12:30
\item[{Office hours:}] 12:30-1:30, or by appointment
\item[{Office hours location:}] TBD
\item[{Course material repository:}] \url{https://github.com/scottrjackson/r\_programming\_bsos\_winter2019}
\end{description}

\section*{Description}
\label{sec:orgaadade7}
R \marginnote{\texttt{www.r-project.org}} is a programming language and environment designed for statistical analysis. It is free and open-source, and it includes integration with thousands of cutting-edge packages contributed by users from around the world. It has become a \emph{de facto} standard and \emph{lingua franca} for statistical analysis.  It is an incredibly powerful tool for data analysis and visualization, and thus an indispensable tool for any kind of quantitative work in the behavioral and social sciences. However, because many (if not most) students and researchers in these fields are not otherwise trained in programming techniques, learning R can be difficult, and poor understanding of programming concepts and techniques can create problems in analysis and reporting of results. 

This course aims to give you a foundation in programming, in order to facilitate future work with R.  It is not a stats course, though we will address a few topics critical to data analysis such as cleaning, formatting, and visualizing your data.  The focus of the course is building concepts, skills, and habits to make you a better programmer, in order to get the most out of R.
\section*{Goals}
\label{sec:orgf5eb5e3}
This course is organized around two sets of themes. First, there is the underlying argument for why a programming language like R is a superior alternative to more limited graphical-interface programs like SPSS or spreadsheet programs like Excel.  You can think of the advantages of R as superpowers for doing research.  There are (at least) three of them:

\begin{description}
\item[{Reproducibility}] You can go back to see \textbf{exactly} what you did, and you can do it again, with virtually no effort.  This also helps make your code work better, and easier to improve upon.
\item[{Repetition}] You can take something you did, and do it hundreds, thousands, or \emph{millions} of times (literally), with very little effort (though maybe some patience). This opens up new avenues like simulations or other kinds of industrial-strength analysis.
\item[{Re-usable code}] You can take code you write and apply it to new situations. This makes what you do more useful, and more share-able.  Share-ability leads to fame and fortune.
\end{description}

In this course, you will learn the basics of each of these superpowers.  You will be able to:
\begin{itemize}
\item work in a more reproducible way using scripts, notebooks, and version control.
\item repeat analysis in loops and other structures to be able to perform large-scale repetition and simulation.
\item write functions to make your code more re-usable and generally applicable, for yourself and others.
\end{itemize}

In order to acquire these superpowers, there are three types of topics we will cover:
\begin{description}
\item[{Core R language:}] You will learn the basics of the R language and be able to work with a variety of data types, functions, and computations.
\item[{Tools:}] You will learn to use one or more interfaces to R (i.e., ways to run R), you will have an opportunity to learn and practice workflows for data analysis, and you will learn the basics of version control software (\texttt{git}).
\item[{Techniques:}] There are lots of ways to do things in R, and you will learn useful tips and best practices for structuring code, documenting code, adapting code, and finding help when you need it.
\end{description}

In summary, this course will help you approach your work with R more like a programmer, which will enable you to make the most of the superpowers that R provides access to.
\section*{Structure of class time}
\label{sec:org8dba609}
Each class is 3 hours.  This time will be divided roughly into four parts:
\begin{enumerate}
\item \textbf{Review:} We will go over the previous day's homework and answer any outstanding questions.
\item \textbf{Lecture:} I'll present some concepts, with slides and/or demos.
\item \textbf{Practice:} You will have some in-class exercises to try, in order to immediately apply the concepts from the lecture.
\item \textbf{Follow-up and troubleshooting:} Things will inevitably go wrong. You are very unlikely to perfectly apply the concepts the first time during practice, and I will probably forget to mention some things along the way. So we will reserve the last hour to talk about the problems you encounter in practice and solutions to those problems.  If everything goes unexpectedly smoothly, we will use this time to cover more advanced extensions of the concepts.
\end{enumerate}
\section*{Schedule}
\label{sec:orgfed41d3}
The following schedule is a work in progress.  Check the online version of this syllabus for the most up-to-date schedule, in case you need to miss a class but are interested in specific topics. In particular, the ``special topic'' and ``review'' days may be used as ``spillover'' days if we need to move more slowly or repeat any of the other topics, and if we have time for special topics, those may change based on student interest.

\begin{center}
\begin{tabular}{ll}
Date & Topic\\
\hline
Jan 7 & Getting started; installation; workflow overview\\
Jan 8 & Basics \#1: objects, functions, packages, and the environment\\
Jan 9 & Basics \#2: working with different kinds of data\\
Jan 10 & Basics \#3: working with complex objects and messy data\\
Jan 11 & Basics \#4: graphics\\
Jan 14 & Review: more graphics or other review\\
Jan 15 & Iteration \#1: loops and control\\
Jan 16 & Iteration \#2: vectorization\\
Jan 17 & Writing functions\\
Jan 18 & Review, simulations (cont'd)\\
\end{tabular}
\end{center}

\section*{Grading}
\label{sec:org87ba4ca}
\subsection*{Overall}
\label{sec:org7f9c58c}
There are three main components that determine your grade:
\begin{enumerate}
\item In-class Practices
\item Out-of-class Homework
\item The Final Project
\end{enumerate}

The overall course grading is based on how much of these components you complete on time:
\begin{description}
\item[{A}] = Completed all three components
\item[{B}] = Completed two components
\item[{C}] = Completed one component
\item[{D}] = Did some work but did not complete any components
\item[{F}] = Left out one or more components entirely
\end{description}

What it means to ``complete'' each of these is described below.
