PSYC798W_Winter2019_syllabus.org
** Practices/attendance
@@latex:\marginnote{\textbf{Required to "complete":} Seven in-class Practices}@@As described above, there will be one or more Practice exercises in each class. In order to get "credit" for a Practice, you need to make a full attempt.  That is, you must complete some code or other activity that represents each step in the Practice, as described in the assignment.  This code does not necessarily have to work!  Practices represent an opportunity to try things and break things, and learn through challenges and even failures. But an honest attempt is required. I may require Practices to be submitted electronically during class, as needed.

Requiring Practices is the method I will use to require attendance, since these can only be completed during class.  You will not receive credit for Practice assignments completed outside of class. There is no separate grade or tracking of attendance.  There is no make-up for a Practice.  The fact that you are only required to complete 7 Practices builds in flexibility if you need to miss one or more classes for any reason. 
** Homework
@@latex:\marginnote{\textbf{Required to "complete":} Seven out-of-class Homework}@@Homework will be assigned with each class.  These will be submitted to me electronically before the next class.  The method of submission will be detailed in the assignment. The assignments will represent some extension or variation on the lesson and Practice of that day.  In order to complete a Homework, you must actually complete the objective for the assignment.  

While the Homework objectives will be the same for all students, the data, and therefore the exact solutions, will be different for each student.  The first assignment is to find a good data set to use throughout the class.  The subsequent assignments will have you explore this data set and practice the things we learn in class.  The purpose of this is to allow and encourage collaboration.  Since everyone's "answers" will be slightly different, each student will need to adapt things for their particular data set.  This closely mimics a common way to learn outside of class, namely cribbing off of other people's code, and thus is designed to set you up to continue to learn on your own.

This data set is also intended to be the data used in the Final Project (described below), and thus the Homework assignments may help you biuld towards that project.

Exercises are due before the beginning of the next class period, and this will be enforced strictly. As with Practices, the requirement to correctly complete only 7 Homework assignments builds in flexibility.  But it is highly recommended to try to complete every Homework, since these will help you in your final project. 
** Final Project
The final part of the course that determines your grade is the Final Project. Here are the requirements and dates:

   - Submit a proposal: :: @@latex:\marginnote{\textbf{Required to pass the course:} Submit proposal by Jan 7}@@ You need to send me a brief written proposal (via email) for your project. This needs to outline how it will address the requirements (data, analysis, etc.). The deadline for this is *11:59 PM EST, Sunday, January 7*. If you do not send a proposal by this deadline, you will not count as "completing" the Final Project.
   - Revise proposal: :: @@latex:\marginnote{\textbf{Required to "complete":} Submit revised proposal (due date determined when I send you feedback)}@@I will look at your proposal and either approve it or send it back to you with suggestions. If I send it back, I may require a revised proposal. I will set the deadline for this revision when I send it back to you.
\newpage
   - Complete the project: :: The project is a set of code completing some kind of analysis. The requirements are:
     1. Pick some data to work with
     2. Perform some kind of analysis, which may result in one or more of:
	1. Numerical results
	2. A complex object (like a regression analysis)
	3. Graphical results (like a plot)
     3. Report the analysis with appropriate documentation
     4. Some aspect of the above (data/analysis/reporting) needs to be "non-trivial," i.e., something we have not explicitly covered in class.  Examples include:
	- Data: especially messy/big/complex data @@latex:\marginnote{\textbf{Example:} analyze a complex public data set, with code that would be helpful to other people in wrangling this data set to work with on their own}@@
	- Programming-dependent analysis: doing something that would be difficult/infeasible/impossible/annoying with a simple "point-and-click" program interface @@latex:\marginnote{\textbf{Example:} a simulation-based analysis requiring loops/iteration}@@
	- Results: tricky visualization, novel way of reporting results @@latex:\marginnote{\textbf{Example:} a cool new way to visually represent/explore data in your field}@@
	- Code: providing useful new function that would be of interest to other people @@latex:\marginnote{\textbf{Example:} a convenience function that people in your lab could use in analyzing data that they commonly work with}@@
     5. Post results and replicable code via GitHub (preferred), or email a complete zipped repository to me. This will be described fully in class. The requirement means that your code should compile/run/complete fully. If it does, and it does what you said in your proposal, then the project will be complete.  You will be able to verify that it works ahead of time, so there should be no uncertainty in whether the project "passes" or not. The due date @@latex:\marginnote{\textbf{Required to pass the course:} Email or post project via GitHub by Jan 23}@@ for the project is *8:00 PM EST, Tuesday, January 23*. Projects posted after this time will not be evaluated.

A more complete set of instructions, suggestions, etc. will be made available during the first week of the course.
* Optional reading
All of the course materials will be provided by me, free. However, because R is so popular and widely used, there are many other excellent resources.  Below is a selection of "most recommended" things to look at, if you want additional information, or if you need a good reference book.

\newpage
** Official R docs and manuals
  1. See here: http://cran.r-project.org/manuals.html
** Recommended general-purpose books
  1. /R in Action/ (Kabacoff): "practical" intro with some more advanced topics, including examples of some common stats analysis
  2. /R in a Nutshell/ (Adler): a good overall reference book
  3. /R Cookbook/ (Teetor): another general reference, with a lot of "recipes" for doing different things
  4. /The Art of R Programming/ (Matloff): a very readable, insightful book from a more programming perspective, good for getting a better handle on the "guts" of R
  5. /Advanced R/ (Wickham): a great resource for digging deeper into understand programming in R, by one of the gods of R. There is a book, but also a website here: http://adv-r.had.co.nz/
  6. /Software for Data Analysis/ (Chambers): big treatise on How R Works, from both a conceptual and technical level. Good for really deepening your understanding of programming for data analysis.
  7. /The R Inferno/ (Burns): a tongue-in-cheek look at some of the traps and pitfalls of working with R (and how to avoid them)
