PSYC798W_Winter2019_syllabus.org
** More specialized stats books
  1. /Discovering Statistics with R/ (Field): nice general-purpose stats reference, written in a very light-hearted style, with tons of R examples
  2. /An R Companion to Applied Regression/ (Fox): excellent textbook on regression, with lots of useful R code, and an accompanying package (=car=) with lots of useful functions
  3. /Data Analysis Using Regression and Multilevel/Hierarchical Models/ (Gelman & Hill): should be required reading if you are interested in using mixed-effects models (aka multilevel/hierarchical models)
  4. /Doing Bayesian Data Analysis/ (Kruschke): very accessible intro to Bayesian analysis, with tons of R code
  5. /Elements of Statistical Learning/ (Hastie, Tibshirani, Friedman): a seminal text on the topic, with R code from the experts
  6. /Regression Modeling Strategies/ (Harris): a good book for digging deeper into regression models. Harris's =rms= and =Hmisc= packages are also very widely used
** Handy websites
  1. Quick-R: a lot of good tips and quick reference, by the author of /R in Action/ (Kabacoff).
  2. Cookbook for R: lots of handy stuff.
  3. R Task Views: a great way to find useful packages.
  4. StackOverflow: a great source for asking questions and getting answers.  Google searches on error messages often lead here.
  5. "The Google": when in doubt...
* Policies and other info
** Honor Code
You will be expected to abide by the student honor code. The exercises are be designed such that comparing notes with other students is allowed and even encouraged.  However, you still need to do your own work.  For any assignment you submit, you will be held to the honor code. If you have any questions at all, please ask me before it becomes a problem.
** Accommodations
Please let me know about any requested accommodations due to disabilities as soon as possible, and we will come up with a plan.
** Inclement weather
If the weather gets nasty, check the UMD website and/or phone line:
   - http://prepare.umd.edu/
   - 301-405-SNOW

** Copyright and licenses					   :noexport:
In this course, I will be providing you with lecture material and software. Please note that all of this is protected by copyright. If there is interest, we can discuss the notion of software licenses, and how this applies to code generated in this course.

You will also be creating code in this course! We can discuss your own copyright and licensing options as well.

PLEASE NOTE: we may discuss issues of copyright and licensing, but I am not actually qualified to offer legal advice. So if you are really concerned about these issues, I encourage you to seek other advice as well.
