PSYC798W_Winter2019_syllabus.tex
\subsection*{More specialized stats books}
\label{sec:orgfe8d2c3}
\begin{enumerate}
\item \emph{Discovering Statistics with R} (Field): nice general-purpose stats reference, written in a very light-hearted style, with tons of R examples
\item \emph{An R Companion to Applied Regression} (Fox): excellent textbook on regression, with lots of useful R code, and an accompanying package (\texttt{car}) with lots of useful functions
\item \emph{Data Analysis Using Regression and Multilevel/Hierarchical Models} (Gelman \& Hill): should be required reading if you are interested in using mixed-effects models (aka multilevel/hierarchical models)
\item \emph{Doing Bayesian Data Analysis} (Kruschke): very accessible intro to Bayesian analysis, with tons of R code
\item \emph{Elements of Statistical Learning} (Hastie, Tibshirani, Friedman): a seminal text on the topic, with R code from the experts
\item \emph{Regression Modeling Strategies} (Harris): a good book for digging deeper into regression models. Harris's \texttt{rms} and \texttt{Hmisc} packages are also very widely used
\end{enumerate}
\subsection*{Handy websites}
\label{sec:org1d27fd6}
\begin{enumerate}
\item Quick-R: a lot of good tips and quick reference, by the author of \emph{R in Action} (Kabacoff).
\item Cookbook for R: lots of handy stuff.
\item R Task Views: a great way to find useful packages.
\item StackOverflow: a great source for asking questions and getting answers.  Google searches on error messages often lead here.
\item ``The Google'': when in doubt\ldots{}
\end{enumerate}
\section*{Policies and other info}
\label{sec:orgc174c67}
\subsection*{Honor Code}
\label{sec:orgc143c8f}
You will be expected to abide by the student honor code. The exercises are be designed such that comparing notes with other students is allowed and even encouraged.  However, you still need to do your own work.  For any assignment you submit, you will be held to the honor code. If you have any questions at all, please ask me before it becomes a problem.
\subsection*{Accommodations}
\label{sec:org4e60b1d}
Please let me know about any requested accommodations due to disabilities as soon as possible, and we will come up with a plan.
\subsection*{Inclement weather}
\label{sec:orgcc04260}
If the weather gets nasty, check the UMD website and/or phone line:
\begin{itemize}
\item \url{http://prepare.umd.edu/}
\item 301-405-SNOW
\end{itemize}
\end{document}